Чтобы эффективно работать с pandas, необходимо освоить самые главные структуры данных библиотеки: DataFrame и Series. Без понимания что они из себя представляют, невозможно в дальнейшем проводить качественный анализ.

In [ ]:
import pandas as pd

# Series

Структура/объект Series представляет из себя объект, похожий на одномерный массив (питоновский список, например), но отличительной его чертой является наличие ассоциированных меток, т.н. индексов, вдоль каждого элемента из списка. Такая особенность превращает его в ассоциативный массив или словарь в Python.

In [ ]:
my_series = pd.Series([5, 6, 7, 8, 9, 10])

In [ ]:
!pip install pandas

In [ ]:
!ls

sample_data

In [ ]:
my_series

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [ ]:
my_series.index

RangeIndex(start=0, stop=6, step=1)

In [ ]:
my_series.values

array([ 5,  6,  7,  8,  9, 10])

In [ ]:
my_series[4]

9

In [ ]:
my_series2 = pd.Series([5, 6, 7, 8, 9, 10], index=['a', 'b', 'c', 'd', 'e', 'f'])

In [ ]:
my_series2['f']

10

In [ ]:
my_series2[['a', 'b', 'f']]

a     5
b     6
f    10
dtype: int64

In [ ]:
my_series2[['a', 'b', 'f']] = 0
my_series2

a    0
b    0
c    7
d    8
e    9
f    0
dtype: int64

In [ ]:
my_series2[my_series2 > 0]

c    7
d    8
e    9
dtype: int64

In [ ]:
my_series2[my_series2 > 0] * 2

c    14
d    16
e    18
dtype: int64

# DataFrame

Объект DataFrame лучше всего представлять себе в виде обычной таблицы и это правильно, ведь DataFrame является табличной структурой данных. В любой таблице всегда присутствуют строки и столбцы. Столбцами в объекте DataFrame выступают объекты Series, строки которых являются их непосредственными элементами.

In [ ]:
df = pd.DataFrame({
  'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
  'population': [17.04, 143.5, 9.5, 45.5],
  'square': [2724902, 17125191, 207600, 603628]
})

In [ ]:
df

      country  population    square
0  Kazakhstan       17.04   2724902
1      Russia      143.50  17125191
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

In [ ]:
df['country']

0    Kazakhstan
1        Russia
2       Belarus
3       Ukraine
Name: country, dtype: object

In [ ]:
df.columns

Index(['country', 'population', 'square'], dtype='object')

.loc - используется для доступа по строковой метке

.iloc - используется для доступа по числовому значению (начиная от 0)

In [ ]:
df.iloc[0]

country       Kazakhstan
population         17.04
square           2724902
Name: 0, dtype: object

In [ ]:
df.loc[2:]

   country  population  square
2  Belarus         9.5  207600
3  Ukraine        45.5  603628

In [ ]:
df.loc[2:, 'country']

2    Belarus
3    Ukraine
Name: country, dtype: object

In [ ]:
df[df.population > 10][['country', 'square']]

      country    square
0  Kazakhstan   2724902
1      Russia  17125191
3     Ukraine    603628

In [ ]:
df['density'] = df['population'] / df['square'] * 1000000
df

      country  population    square    density
0  Kazakhstan       17.04   2724902   6.253436
1      Russia      143.50  17125191   8.379469
2     Belarus        9.50    207600  45.761079
3     Ukraine       45.50    603628  75.377550

In [ ]:
df = df.drop(['density'], axis='columns')

In [ ]:
df

      country  population    square
0  Kazakhstan       17.04   2724902
1      Russia      143.50  17125191
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

In [ ]:
df = df.rename(columns={'country': 'Country'})
df

      Country  population    square
0  Kazakhstan       17.04   2724902
1      Russia      143.50  17125191
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

# Чтение и запись данных

In [ ]:
df.to_csv('filename.csv')
df = pd.read_csv('filename.csv', sep=',')

# Группировка и агрегирование в pandas

In [ ]:
titanic_df = pd.read_csv('titanic.csv')

In [ ]:
titanic_df.head(13)

    PassengerID  ... SexCode
0             1  ...       1
1             2  ...       1
2             3  ...       0
3             4  ...       1
4             5  ...       0
5             6  ...       0
6             7  ...       1
7             8  ...       0
8             9  ...       1
9            10  ...       0
10           11  ...       0
11           12  ...       1
12           13  ...       1

[13 rows x 7 columns]

In [ ]:
# Необходимо подсчитать, сколько женщин и мужчин выжило, а сколько нет.
titanic_df.groupby(['Sex', 'Survived'])['PassengerID'].count()

Sex     Survived
female  0           154
        1           308
male    0           709
        1           142
Name: PassengerID, dtype: int64

# Сводные таблицы в pandas

In [ ]:
pvt = titanic_df.pivot_table(index=['Sex'], columns=['PClass'], values='Name', aggfunc='count')

In [ ]:
pvt.loc['female', ['1st', '2nd', '3rd']]

PClass
1st    143.0
2nd    107.0
3rd    212.0
Name: female, dtype: float64

In [ ]:
pvt

PClass    *    1st    2nd    3rd
Sex
female  NaN  143.0  107.0  212.0
male    1.0  179.0  172.0  499.0

# Предобработка

## Пропуски в данных

https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html

In [ ]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 7 columns):
PassengerID    1313 non-null int64
Name           1313 non-null object
PClass         1313 non-null object
Age            756 non-null float64
Sex            1313 non-null object
Survived       1313 non-null int64
SexCode        1313 non-null int64
dtypes: float64(1), int64(3), object(3)
memory usage: 71.9+ KB

In [ ]:
titanic_df.isnull().sum()

PassengerID      0
Name             0
PClass           0
Age            557
Sex              0
Survived         0
SexCode          0
dtype: int64

In [ ]:
titanic_df.fillna(titanic_df.mean()).isnull().sum()

PassengerID    0
Name           0
PClass         0
Age            0
Sex            0
Survived       0
SexCode        0
dtype: int64

In [ ]:
titanic_df.mean()

PassengerID    657.000000
Age             30.397989
Survived         0.342727
SexCode          0.351866
dtype: float64

In [ ]:
titanic_df.mean()

In [ ]:
titanic_df.dropna()

      PassengerID  ... SexCode
0               1  ...       1
1               2  ...       1
2               3  ...       0
3               4  ...       1
4               5  ...       0
...           ...  ...     ...
1308         1309  ...       0
1309         1310  ...       0
1310         1311  ...       0
1311         1312  ...       0
1312         1313  ...       0

[756 rows x 7 columns]

In [ ]:
titanic_df.dropna(axis=1)

      PassengerID  ... SexCode
0               1  ...       1
1               2  ...       1
2               3  ...       0
3               4  ...       1
4               5  ...       0
...           ...  ...     ...
1308         1309  ...       0
1309         1310  ...       0
1310         1311  ...       0
1311         1312  ...       0
1312         1313  ...       0

[1313 rows x 6 columns]

## One-hot кодирование

In [ ]:
df = pd.DataFrame({
  'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
  'population': [17.04, 143.5, 9.5, 45.5],
  'square': [2724902, 17125191, 207600, 603628]
})
df

      country  population    square
0  Kazakhstan       17.04   2724902
1      Russia      143.50  17125191
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

In [ ]:
pd.get_dummies(df,prefix=['c'], columns=['country'])

   population    square  c_Belarus  c_Kazakhstan  c_Russia  c_Ukraine
0       17.04   2724902          0             1         0          0
1      143.50  17125191          0             0         1          0
2        9.50    207600          1             0         0          0
3       45.50    603628          0             0         0          1

In [ ]:
df = pd.DataFrame({
    'has_dogs':[True,False,True,True,False,True],
    'country': ['germany', None ,'germany','united kingdom','america','united kingdom']
})
df

   has_dogs         country
0      True         germany
1     False            None
2      True         germany
3      True  united kingdom
4     False         america
5      True  united kingdom

In [ ]:
pd.get_dummies(df)

   has_dogs  country_america  country_germany  country_united kingdom
0      True                0                1                       0
1     False                0                0                       0
2      True                0                1                       0
3      True                0                0                       1
4     False                1                0                       0
5      True                0                0                       1

## Ordinal Encoding

In [ ]:
mapping = {'1st': 1,
           '2nd': 2,
           '3rd': 3 }

titanic_df['PClass'] = titanic_df['PClass'].map(mapping)
titanic_df

      PassengerID  ... SexCode
0               1  ...       1
1               2  ...       1
2               3  ...       0
3               4  ...       1
4               5  ...       0
...           ...  ...     ...
1308         1309  ...       0
1309         1310  ...       0
1310         1311  ...       0
1311         1312  ...       0
1312         1313  ...       0

[1313 rows x 7 columns]

In [ ]:
titanic_df['PClass']

0       1.0
1       1.0
2       1.0
3       1.0
4       1.0
       ...
1308    3.0
1309    3.0
1310    3.0
1311    3.0
1312    3.0
Name: PClass, Length: 1313, dtype: float64

In [ ]:
titanic_df['PClass'] = titanic_df['PClass'].astype('int64', copy=False)

In [ ]:
titanic_df